RIOT-OS/RIOT/cpu/stm32/periph/usbdev_fs.c
/*
 * Copyright (C) 2021 Mesotic SAS
 *
 * This file is subject to the terms and conditions of the GNU Lesser
 * General Public License v2.1. See the file LICENSE in the top level
 * directory for more details.
 */

/**
 * @ingroup cpu_stm32
 * @{
 * @file
 * @brief   Low level USB interface functions for the stm32 FS devices
 *
 * @author  Dylan Laduranty <dylan.laduranty@mesotic.com>
 * @}
 */

#define USB_H_USER_IS_RIOT_INTERNAL

#include <assert.h>
#include <stdint.h>
#include <stdlib.h>
#include <errno.h>

#include "bitarithm.h"
#include "cpu.h"
#include "cpu_conf.h"
#include "periph/pm.h"
#include "periph/gpio.h"
#include "periph/usbdev.h"
#include "usbdev_stm32.h"
#include "pm_layered.h"
#include "ztimer.h"

#include <string.h>
/**
 * Be careful with enabling debug here. As with all timing critical systems it
 * is able to interfere with USB functionality and you might see different
 * errors than debug disabled
 */
#define ENABLE_DEBUG 0
#include "debug.h"

#ifndef USB1_PMAADDR
#define USB1_PMAADDR USB_PMAADDR
#endif /* ndef USB1_PMAADDR */

/**
 * There are two schemes for accessing the packet buffer area (PMA) from the CPU:
 *
 * - 2 x 16 bit/word access scheme where two 16-bit half-words per word can be
 *   accessed. With this scheme the access can be half-word aligned and the
 *   PMA address offset corresponds therefore to the local USB IP address.
 *   The size of the PMA SRAM is usually 1024 byte.
 * - 1 x 16 bit/word access scheme where one 16-bit half word per word can be
 *   accessed. With this scheme the access can only be word-aligned and the
 *   PMA address offset to a half-word is therefore twice the local USB IP
 *   address. The size of the PMA SRAM is usually 512 byte.
 *
 * Which access scheme is used depends on the STM32 model.
 */
#if defined(CPU_LINE_STM32F303xD) || defined(CPU_LINE_STM32F303xE) || \
    defined(CPU_LINE_STM32WB35xx) || defined(CPU_LINE_STM32WB55xx)

#define _ENDPOINT_NUMOF         (8)     /* Number of endpoints */
#define _PMA_SRAM_SIZE          (1024)  /* Size of Packet buffer Memory Area (PMA) SRAM */
#define _PMA_ACCESS_SCHEME      (2)     /* 2 x 16-bit/word */
#define _PMA_ACCESS_STEP_SIZE   (1)     /* Step size in 16-bit half-words when
                                         * accessing the PMA SRAM from CPU */
#elif defined(CPU_LINE_STM32F103xB) || \
      defined(CPU_LINE_STM32F303xB) || defined(CPU_LINE_STM32F303xC)

#define _ENDPOINT_NUMOF         (8)     /* Number of endpoints */
#define _PMA_SRAM_SIZE          (512)   /* Size of Packet buffer Memory Area (PMA) SRAM */
#define _PMA_ACCESS_SCHEME      (1)     /* 1 x 16-bit/word */
#define _PMA_ACCESS_STEP_SIZE   (2)     /* Step size in 16-bit half-words when
                                         * accessing the PMA SRAM from CPU */
#else
#error "STM32 line is not supported"
#endif

/* UUSB IP local base address for the endpoints buffers in PMA SRAM */
#define _PMA_BUF_BASE_OFFSET    (_ENDPOINT_NUMOF * 8)

/* List of instantiated USB peripherals */
static stm32_usbdev_fs_t _usbdevs[USBDEV_NUMOF];

static usbdev_ep_t _ep_in[_ENDPOINT_NUMOF];
static usbdev_ep_t _ep_out[_ENDPOINT_NUMOF];

/* 16-bit addresses used by the USB IP as endpoint buffers in the PMA SRAM */
static uint16_t _ep_in_buf[_ENDPOINT_NUMOF];
static uint16_t _ep_out_buf[_ENDPOINT_NUMOF];

/* Buffers used for receiving packets on OUT EPs. */
static uint8_t* _app_pbuf[_ENDPOINT_NUMOF];

/* Forward declaration for the usb device driver */
const usbdev_driver_t driver;

static USB_TypeDef *_global_regs(const stm32_usbdev_fs_config_t *conf)
{
    return (USB_TypeDef *)conf->base_addr;
}

#if _PMA_ACCESS_SCHEME == 1

/* Endpoint Buffer Descriptor for the 1 x 16-bit/word access scheme
 * (word-aligned access). Even though the members define 16-bit USB IP local
 * addresses, they have to be defined as 32-bit unsigned for word-aligned
 * access */
typedef struct {
    uint32_t addr_tx;       /* buffer address (16-bit USB IP local address) */
    uint32_t count_tx;      /* byte count (16-bit) */
    uint32_t addr_rx;       /* buffer address (16-bit USB IP local address) */
    uint32_t count_rx;      /* byte count (16-bit) */
} ep_buf_desc_t;

#elif _PMA_ACCESS_SCHEME == 2

/* Endpoint Buffer Descriptor for the 2 x 16-bits/word access scheme
 * (half-word-aligned access) */
typedef struct {
    uint16_t addr_tx;
    uint16_t count_tx;
    uint16_t addr_rx;
    uint16_t count_rx;
} ep_buf_desc_t;

#else
#error "_PMA_ACCESS_SCHEME is not defined"
#endif

#define EP_DESC ((ep_buf_desc_t*)USB1_PMAADDR)
#define EP_REG(x) (*((volatile uint32_t*) (((uintptr_t)(USB)) + (4*x))))

usbdev_t *usbdev_get_ctx(unsigned num)
{
    assert(num < USBDEV_NUMOF);
    return &_usbdevs[num].usbdev;
}

static inline void _enable_irq(void)
{
    stm32_usbdev_fs_t *usbdev = &_usbdevs[0];
    const stm32_usbdev_fs_config_t *conf = usbdev->config;
    _global_regs(conf)->CNTR = USB_CNTR_CTRM | USB_CNTR_RESETM  |
                               USB_CNTR_ERRM | USB_CNTR_PMAOVRM;
}

static void _setup(stm32_usbdev_fs_t *usbdev,
                      const stm32_usbdev_fs_config_t *config)
{
    usbdev->usbdev.driver = &driver;
    usbdev->config = config;
    usbdev->out = _ep_out;
    usbdev->in = _ep_in;
}

static uint32_t _type_to_reg(usb_ep_type_t type)
{
    switch (type) {
        case USB_EP_TYPE_CONTROL:
            return USB_EP_CONTROL;
        case USB_EP_TYPE_ISOCHRONOUS:
            return USB_EP_ISOCHRONOUS;
        case USB_EP_TYPE_BULK:
            return USB_EP_BULK;
        case USB_EP_TYPE_INTERRUPT:
            return USB_EP_INTERRUPT;
        default:
            assert(false);
            return 0;
    }
}

void usbdev_init_lowlevel(void)
{
    for (size_t i = 0; i < USBDEV_NUMOF; i++) {
        _setup(&_usbdevs[i], &stm32_usbdev_fs_config[i]);
    }
}

/*TODO: rework this function (maybe move it outside this file)
        for other ST families support */
static void _enable_usb_clk(void)
{
#if defined(PWR_CR2_USV)
    /* Validate USB Supply */
    PWR->CR2 |= PWR_CR2_USV;
#endif

