RIOT-OS/RIOT/cpu/stm32/periph/usbdev_fs.c
#if defined(RCC_APB1SMENR_USBSMEN)
    RCC->APB1SMENR |= RCC_APB1SMENR_USBSMEN;
#elif defined(RCC_APB1SMENR1_USBSMEN)
    RCC->APB1SMENR1 |= RCC_APB1SMENR1_USBSMEN;
#endif

#if defined(CRS_CR_AUTOTRIMEN) && defined(CRS_CR_CEN)
    /* Enable CRS with auto trim enabled */
    CRS->CR |=  (CRS_CR_AUTOTRIMEN |  CRS_CR_CEN);
#endif
}

static void _enable_gpio(const stm32_usbdev_fs_config_t *conf)
{
    if (conf->af == GPIO_AF_UNDEF && conf->disconn == GPIO_UNDEF) {
        /* If the MCU does not have an internal D+ pullup and there is no
         * dedicated GPIO on the board to simulate a USB disconnect, the D+ GPIO
         * is temporarily configured as an output and pushed down to simulate
         * a disconnect/connect cycle to allow the host to recognize the device.
         * This requires an external pullup on D+ signal to work. */
        gpio_init(conf->dp, GPIO_OUT);
        gpio_clear(conf->dp);
        /* wait a 1 ms */
        ztimer_sleep(ZTIMER_MSEC, 1);
        gpio_init(conf->dp, GPIO_IN);
    }
    if (conf->af != GPIO_AF_UNDEF) {
        /* Configure AF for the pins */
        gpio_init_af(conf->dp, conf->af);
        gpio_init_af(conf->dm, conf->af);
    }

    if (conf->disconn != GPIO_UNDEF) {
        /* In case the MCU has no internal D+ pullup, a GPIO is used to
         * connect/disconnect from USB bus */
        gpio_init(conf->disconn, GPIO_OUT);
        gpio_clear(conf->disconn);
    }
}

static void _set_ep_in_status(uint16_t *val, uint16_t mask)
{
    /* status endpoints bits can only be toggled, writing 0
       as no effect. Thus, check which bits should be set
       then XOR it with their current value */
    if (mask & USB_EPTX_DTOG1) {
        *val ^= USB_EPTX_DTOG1;
    }
    if (mask & USB_EPTX_DTOG2) {
        *val ^= USB_EPTX_DTOG2;
    }
}

static void _set_ep_out_status(uint16_t *val, uint16_t mask)
{
    /* status endpoints bits can only be toggled, writing 0
     * as no effect. Thus, check which bits should be set
     * then XOR it with their current value */

    if (mask & USB_EPRX_DTOG1) {
        *val ^= USB_EPRX_DTOG1;
    }
    if (mask & USB_EPRX_DTOG2) {
        *val ^= USB_EPRX_DTOG2;
    }
}

static inline void _usb_attach(stm32_usbdev_fs_t *usbdev)
{
    const stm32_usbdev_fs_config_t *conf = usbdev->config;

    /* Some ST USB IP doesn't have this feature */
#ifdef USB_BCDR_DPPU
    /* Enable DP pullup to signal connection */
    _global_regs(conf)->BCDR |= USB_BCDR_DPPU;
    while (!(CRS->ISR & CRS_ISR_ESYNCF)) {}
#else
    /* If configuration uses a GPIO for USB connect/disconnect */
    if (conf->disconn != GPIO_UNDEF) {
        gpio_set(conf->disconn);
    }
#endif /* USB_BCDR_DPPU */
}

static inline void _usb_detach(stm32_usbdev_fs_t *usbdev)
{
    const stm32_usbdev_fs_config_t *conf = usbdev->config;

    /* Some ST USB IP doesn't have this feature */
#ifdef USB_BCDR_DPPU
    DEBUG_PUTS("usbdev_fs: Detaching from host");

    /* Disable DP pullup to signal disconnection */
    CLRBIT(_global_regs(conf)->BCDR, USB_BCDR_DPPU);
#else
    /* If configuration uses a GPIO for USB connect/disconnect */
    if (conf->disconn != GPIO_UNDEF) {
        gpio_clear(conf->disconn);
    }
#endif
}

static void _set_address(stm32_usbdev_fs_t *usbdev, uint8_t address)
{
    const stm32_usbdev_fs_config_t *conf = usbdev->config;
    _global_regs(conf)->DADDR = USB_DADDR_EF | (address & USB_DADDR_ADD);
}

void USBDEV_ISR(void) {
    stm32_usbdev_fs_t *usbdev = &_usbdevs[0];
    const stm32_usbdev_fs_config_t *conf = usbdev->config;
    int irq_status = _global_regs(conf)->ISTR;
    /* Disable interrupts temporarily */
    _global_regs(conf)->CNTR = 0;
    /* Correct transfer Interrupt */
    if (_global_regs(conf)->ISTR & USB_ISTR_CTR) {
        /* Clear pending interrupts */
        _global_regs(conf)->ISTR = 0;
        /* Get endpoint number and associated ep pointer */
        unsigned epnum = irq_status & 0x000F;
        usbdev_ep_t *ep = (irq_status & USB_ISTR_DIR) ? &_ep_out[epnum] : &_ep_in[epnum];
        /* get type and add endpoint address */
        uint16_t reg = _type_to_reg(ep->type) | ep->num;

        if (irq_status & USB_ISTR_DIR) {
            /* Clear RX CTR by writing 0, avoid clear TX CTR so leave it to one */
            EP_REG(epnum) = reg | USB_EP_CTR_TX;
            usbdev->usbdev.epcb(ep, USBDEV_EVENT_ESR);
        } else {
            /* Clear TX CTR by writing 0, avoid clear RX CTR so leave it to one */
            EP_REG(epnum) = reg | USB_EP_CTR_RX;
            usbdev->usbdev.epcb(ep, USBDEV_EVENT_ESR);
        }
    } else if (_global_regs(conf)->ISTR & USB_ISTR_RESET) {
        usbdev->usbdev.cb(&usbdev->usbdev, USBDEV_EVENT_ESR);
    } else if (_global_regs(conf)->ISTR & USB_ISTR_PMAOVR) {
        _global_regs(conf)->ISTR = 0;
    } else {
        _global_regs(conf)->ISTR = 0;
    }
    cortexm_isr_end();
}

static void _usbdev_init(usbdev_t *dev)
{
    stm32_usbdev_fs_t *usbdev = (stm32_usbdev_fs_t *)dev;
    const stm32_usbdev_fs_config_t *conf = usbdev->config;

    DEBUG_PUTS("usbdev_fs: initialization");
    /* Block STOP/STANDBY */
    pm_block(STM32_PM_STOP);
    pm_block(STM32_PM_STANDBY);

#if defined(RCC_CFGR_USBPRE)
    /* If `RCC_CFGR_USBPRE` is defined, the USB device FS clock of 48 MHz is
     * derived from the PLL clock. In this case the PLL clock must be configured
     * and must be either 48 MHz or 72 MHz. If the PLL clock is 72 MHz it is
     * pre-divided by 1.5, the PLL clock of 48 MHz is used directly. */
#if defined(CLOCK_PLL_SRC) && (CLOCK_CORECLOCK == MHZ(72))
    RCC->CFGR &= ~RCC_CFGR_USBPRE;
#elif defined(CLOCK_PLL_SRC) && (CLOCK_CORECLOCK == MHZ(48))
    RCC->CFGR |= RCC_CFGR_USBPRE;
#else
#error "PLL must be configured to output 48 or 72 MHz"
#endif
#endif

    /* Enable the clock to the peripheral */
    periph_clk_en(conf->apb, conf->rcc_mask);
    /* Enable USB clock */
    _enable_usb_clk();
    /* Configure GPIOs */
    _enable_gpio(conf);

    /* Reset and power down USB IP */
    _global_regs(conf)->CNTR = USB_CNTR_FRES | USB_CNTR_PDWN;
    /* Clear power down */
    _global_regs(conf)->CNTR &= ~USB_CNTR_PDWN;
    /* Clear reset */
    _global_regs(conf)->CNTR &= ~USB_CNTR_FRES;
    /* Clear interrupt register */
    _global_regs(conf)->ISTR = 0x0000;
    /* Set BTABLE at start of USB SRAM */
    _global_regs(conf)->BTABLE = 0x0000;
    /* Set default address after reset */
    _global_regs(conf)->DADDR = USB_DADDR_EF;
    /* Unmask the interrupt in the NVIC */
    _enable_irq();

    /* Disable remapping of USB IRQs if remapping defined */
#ifdef SYSCFG_CFGR1_USB_IT_RMP
    SYSCFG->CFGR1 &= ~SYSCFG_CFGR1_USB_IT_RMP;
#endif

