RIOT-OS/RIOT/cpu/stm32/periph/usbdev_fs.c
    /* Enable USB IRQ */
    NVIC_EnableIRQ(conf->irqn);
    /* fill USB SRAM with zeroes */
    memset((uint8_t*)USB1_PMAADDR, 0, 1024);
}

static usbdev_ep_t *_get_ep(stm32_usbdev_fs_t *usbdev, unsigned num,
                            usb_ep_dir_t dir)
{
    if (num >= _ENDPOINT_NUMOF) {
        return NULL;
    }
    return dir == USB_EP_DIR_IN ? &usbdev->in[num] : &usbdev->out[num];
}

static bool _ep_check(usbdev_ep_t* ep)
{
    /* Check if endpoint already configured */
    if (ep->dir == USB_EP_DIR_IN) {
        if ((EP_REG(ep->num) & USB_EPTX_STAT) == USB_EP_TX_DIS) {
            return true;
        }
    }
    else {
        if ((EP_REG(ep->num) & USB_EPRX_STAT) == USB_EP_RX_DIS) {
            return true;
        }
    }
    return false;
}

static void _ep_enable(usbdev_ep_t *ep)
{
    uint16_t reg = EP_REG(ep->num);
    /* Avoid modification of the following registers */
    SETBIT(reg, USB_EP_CTR_RX | USB_EP_CTR_TX);
    if (ep->dir == USB_EP_DIR_OUT) {
        _set_ep_out_status(&reg, USB_EP_RX_NAK);
        /* Avoid toggling the other direction */
        CLRBIT(reg, USB_EP_TX_VALID);
    }
    else {
        _set_ep_in_status(&reg, USB_EP_TX_NAK);
        /* Avoid toggling the other direction */
        CLRBIT(reg, USB_EP_RX_VALID);
    }

    EP_REG(ep->num) = reg;
}

static void _ep_disable(usbdev_ep_t *ep)
{
    uint16_t reg = EP_REG(ep->num);
    /* Avoid modification of the following registers */
    SETBIT(reg, USB_EP_CTR_RX | USB_EP_CTR_TX);

    if (ep->dir == USB_EP_DIR_OUT) {
        _set_ep_out_status(&reg, USB_EP_RX_DIS);
        /* Avoid toggling the other direction */
        CLRBIT(reg, USB_EP_TX_VALID);
    }
    else {
        _set_ep_in_status(&reg, USB_EP_TX_DIS);
        /* Avoid toggling the other direction */
        CLRBIT(reg, USB_EP_RX_VALID);
    }
    EP_REG(ep->num) = reg;
}

static usbdev_ep_t *_usbdev_new_ep(usbdev_t *dev, usb_ep_type_t type,
                                   usb_ep_dir_t dir, size_t len)
{
    stm32_usbdev_fs_t *usbdev = (stm32_usbdev_fs_t *)dev;
    /* The IP supports all types for all endpoints */
    usbdev_ep_t *new_ep = NULL;

    /* Always return endpoint 0 for control types as requested by IP */
    if (type == USB_EP_TYPE_CONTROL) {
        new_ep = _get_ep(usbdev, 0, dir);
        new_ep->num = 0;
    }
    else {
        /* Find the first unassigned ep with proper dir */
        for (unsigned idx = 1; idx < _ENDPOINT_NUMOF && !new_ep; idx++) {
            usbdev_ep_t *ep = _get_ep(usbdev, idx, dir);
            /* Check if endpoint is available */
            bool avail = _ep_check(ep);
            if (ep->type == USB_EP_TYPE_NONE && avail) {
                new_ep = ep;
                new_ep->num = idx;
            }
        }
    }
    if (new_ep) {
        if (usbdev->used + len < _PMA_SRAM_SIZE) {
            if (dir == USB_EP_DIR_IN) {
                _ep_in_buf[new_ep->num] = (_PMA_BUF_BASE_OFFSET + usbdev->used);
            } else {
                _ep_out_buf[new_ep->num] = (_PMA_BUF_BASE_OFFSET + usbdev->used);
            }
            usbdev->used += len;
            new_ep->len = len;
            new_ep->type = type;
            new_ep->dev = dev;
            new_ep->dir = dir;
            DEBUG("usbdev_fs: register new %s endpoint as EP%d\n",
                   new_ep->dir == USB_EP_DIR_IN ? "IN": "OUT", new_ep->num);
            DEBUG("usbdev_fs: %d bytes used\n", usbdev->used);
        }
        else {
            assert(0);
        }
    }

    return new_ep;
}

static int _usbdev_get(usbdev_t *usbdev, usbopt_t opt,
                       void *value, size_t max_len)
{
    (void)usbdev;
    (void)max_len;
    int res = -ENOTSUP;

    switch (opt) {
        case USBOPT_MAX_VERSION:
            assert(max_len == sizeof(usb_version_t));
            *(usb_version_t *)value = USB_VERSION_20;
            res = sizeof(usb_version_t);
            break;
        case USBOPT_MAX_SPEED:
            assert(max_len == sizeof(usb_speed_t));
            *(usb_speed_t *)value = USB_SPEED_FULL;
            res = sizeof(usb_speed_t);
            break;
        default:
            DEBUG("Unhandled get call: 0x%x\n", opt);
            break;
    }
    return res;
}

static int _usbdev_set(usbdev_t *dev, usbopt_t opt,
                       const void *value, size_t value_len)
{
    (void)value_len;
    stm32_usbdev_fs_t *usbdev = (stm32_usbdev_fs_t *)dev;

    int res = -ENOTSUP;

    switch (opt) {
        case USBOPT_ADDRESS:
            assert(value_len == sizeof(uint8_t));
            uint8_t addr = (*((uint8_t *)value));
            _set_address(usbdev, addr);
            break;
        case USBOPT_ATTACH:
            assert(value_len == sizeof(usbopt_enable_t));
            if (*((usbopt_enable_t *)value)) {
                _usb_attach(usbdev);
            }
            else {
                _usb_detach(usbdev);
            }
            res = sizeof(usbopt_enable_t);
            break;
        default:
            DEBUG("usbdev_fs: Unhandled set call: 0x%x\n", opt);
            break;
    }
    return res;
}

static void _usbdev_esr(usbdev_t *dev)
{
    stm32_usbdev_fs_t *usbdev = (stm32_usbdev_fs_t *)dev;
    const stm32_usbdev_fs_config_t *conf = usbdev->config;

    if (_global_regs(conf)->ISTR & USB_ISTR_RESET) {
        usbdev->usbdev.cb(&usbdev->usbdev, USBDEV_EVENT_RESET);
        _global_regs(conf)->ISTR = (uint16_t)~USB_ISTR_RESET;
    }
    else {
        _global_regs(conf)->ISTR = 0x0000;
    }
    _enable_irq();
}

static void _usbdev_ep_init(usbdev_ep_t *ep)
{
    /* Set endpoint type */
    uint16_t reg  = _type_to_reg(ep->type);
    /* Keep previous state if already set */
    reg |= EP_REG(ep->num) & (USB_EPTX_STAT | USB_EPRX_STAT);
    _set_ep_out_status(&reg, USB_EP_RX_VALID);
    /* Assign EP address */
    reg |= (ep->num & 0x000F);
    /* Ensure interrupts are cleared */
    reg |= USB_EP_CTR_RX | USB_EP_CTR_TX;

    EP_REG(ep->num) = reg;
    if (ep->dir == USB_EP_DIR_IN) {
        EP_DESC[ep->num].addr_tx = _ep_in_buf[ep->num];
        EP_DESC[ep->num].count_tx = 64;
    } else {
        EP_DESC[ep->num].addr_rx = _ep_out_buf[ep->num];
        /* Set BLSIZE + NUM_BLOCK (1) */
        EP_DESC[ep->num].count_rx = (1 << 10) | (1 << 15);
    }
}

static usbopt_enable_t _ep_get_stall(usbdev_ep_t *ep)
{
    usbopt_enable_t res;

