RIOT-OS/RIOT/cpu/stm32/periph/usbdev_fs.c
    if (ep->dir == USB_EP_DIR_IN) {
        res = ((EP_REG(ep->num) & USB_EPTX_STAT) == USB_EP_TX_STALL) ?
              USBOPT_ENABLE : USBOPT_DISABLE;
    } else {
        res = ((EP_REG(ep->num) & USB_EPRX_STAT) == USB_EP_RX_STALL) ?
              USBOPT_ENABLE : USBOPT_DISABLE;
    }
    return res;
}

static size_t _ep_get_available(usbdev_ep_t *ep)
{
    size_t size;

    if (ep->dir == USB_EP_DIR_OUT) {
        size = EP_DESC[ep->num].count_rx & 0x03FF;
    } else {
        size = EP_DESC[ep->num].count_tx;
    }
    return size;
}

static int _usbdev_ep_get(usbdev_ep_t *ep, usbopt_ep_t opt,
                          void *value, size_t max_len)
{
    (void)max_len;
    int res = -ENOTSUP;
    switch (opt) {
        case USBOPT_EP_STALL:
            assert(max_len == sizeof(usbopt_enable_t));
            *(usbopt_enable_t *)value = _ep_get_stall(ep);
            res = sizeof(usbopt_enable_t);
            break;
        case USBOPT_EP_AVAILABLE:
            assert(max_len == sizeof(size_t));
            *(size_t *)value = _ep_get_available(ep);
            res = sizeof(size_t);
            break;
        default:
            DEBUG("usbdev_fs: Unhandled get call: 0x%x\n", opt);
            break;
    }
    return res;
}

static void _ep_set_stall(usbdev_ep_t *ep, usbopt_enable_t enable)
{
    uint16_t reg = EP_REG(ep->num);
    /* Avoid modification of the following registers */
    SETBIT(reg, USB_EP_CTR_RX | USB_EP_CTR_TX);

    if (ep->dir == USB_EP_DIR_IN) {
        _set_ep_in_status(&reg, enable ? USB_EP_TX_STALL : USB_EP_TX_NAK);
        /* Avoid toggling the other direction */
        CLRBIT(reg, USB_EP_RX_VALID);
    }
    else {
        _set_ep_out_status(&reg, enable ? USB_EP_RX_STALL : USB_EP_RX_NAK);
        /* Avoid toggling the other direction */
        CLRBIT(reg, USB_EP_TX_VALID);
    }

    EP_REG(ep->num) = reg;
}

static int _usbdev_ep_set(usbdev_ep_t *ep, usbopt_ep_t opt,
                          const void *value, size_t value_len)
{
    (void)value_len;
    int res = -ENOTSUP;

    switch (opt) {
        case USBOPT_EP_ENABLE:
            assert(value_len == sizeof(usbopt_enable_t));
            if (*((usbopt_enable_t *)value)) {
                _usbdev_ep_init(ep);
                _ep_enable(ep);
            }
            else {
                _ep_disable(ep);
            }
            res = sizeof(usbopt_enable_t);
            break;
        case USBOPT_EP_STALL:
            assert(value_len == sizeof(usbopt_enable_t));
            _ep_set_stall(ep, *(usbopt_enable_t *)value);
            res = sizeof(usbopt_enable_t);
            break;
        default:
            DEBUG("usbdev_fs: Unhandled endpoint set call: 0x%x\n", opt);
            break;
    }
    return res;
}

static void _usbdev_ep_esr(usbdev_ep_t *ep)
{
    if (ep->dir == USB_EP_DIR_OUT) {
        /* Copy PMA SRAM buffer to OUT buffer */
        /* `addr_rx` is the USB IP local address offset in half-words. The PMA
         * address offset depends on the access scheme.
         * - 2 x 16 bits/word access scheme: `_PMA_ACCESS_STEP_SIZE` is 1
         *   and the PMA address offset corresponds to USB IP local address.
         * - 1 x 16 bits/word access scheme: `_PMA_ACCESS_STEP_SIZE` is 2
         *   and the PMA address offset is the double of the USB IP local
         *   address. */
        uint16_t* pma_ptr = (uint16_t *)(USB1_PMAADDR +
                                         (EP_DESC[ep->num].addr_rx * _PMA_ACCESS_STEP_SIZE));
        uint16_t hword;
        uint8_t cpt = 0;
        while (cpt < 64) {
            hword = *pma_ptr;
            _app_pbuf[ep->num][cpt++] = hword & 0x00ff;
            _app_pbuf[ep->num][cpt++] = (hword & 0xff00) >> 8;
            pma_ptr += _PMA_ACCESS_STEP_SIZE;
        }
    }
    ep->dev->epcb(ep, USBDEV_EVENT_TR_COMPLETE);
    _enable_irq();
}

static int _usbdev_ep_xmit(usbdev_ep_t *ep, uint8_t* buf, size_t len)
{
    unsigned irq = irq_disable();
    uint16_t reg = EP_REG(ep->num);
    /* Avoid modification of the following registers */
    SETBIT(reg, USB_EP_CTR_RX | USB_EP_CTR_TX);
    if (ep->dir == USB_EP_DIR_OUT) {
        _set_ep_out_status(&reg, USB_EP_RX_VALID);
        _set_ep_in_status(&reg, USB_EP_TX_NAK);
        if (len == 0) {
            len = ep->len;
        }
        if (len < 63) {
            /* Should write len / 2 in count_rx if len <= 62 */
            EP_DESC[ep->num].count_rx = (len >> 1) << 10;
        } else {
            /* BL_SIZE = 1, NUM_BLOCK = 1 */
            EP_DESC[ep->num].count_rx = 1 << 15 | 1 << 10;
        }
        CLRBIT(reg, USB_EP_DTOG_TX | USB_EP_DTOG_RX);
        _app_pbuf[ep->num] = buf;
    } else {
        _set_ep_in_status(&reg, USB_EP_TX_VALID);
        _set_ep_out_status(&reg, USB_EP_RX_VALID);

        /* Transfer IN buffer content to USB PMA SRAM */
        uint16_t* pma_ptr = (uint16_t *)(USB1_PMAADDR +
                                         (EP_DESC[ep->num].addr_tx * _PMA_ACCESS_STEP_SIZE));
        for (size_t i = 0; i < len; i += 2) {
            *pma_ptr = (buf[i + 1] << 8) | buf[i];
            pma_ptr += _PMA_ACCESS_STEP_SIZE;
        }
        /* Manage odd transfer size */
        if (len % 2 == 1) {
            *pma_ptr =  0x00ff & buf[len - 1];
        }

        EP_DESC[ep->num].count_tx = len;
        CLRBIT(reg, USB_EP_DTOG_TX | USB_EP_DTOG_RX);
    }

    EP_REG(ep->num) = reg;
    irq_restore(irq);
    return 0;
}

const usbdev_driver_t driver = {
    .init = _usbdev_init,
    .new_ep = _usbdev_new_ep,
    .get = _usbdev_get,
    .set = _usbdev_set,
    .esr = _usbdev_esr,
    .ep_init = _usbdev_ep_init,
    .ep_get = _usbdev_ep_get,
    .ep_set = _usbdev_ep_set,
    .ep_esr = _usbdev_ep_esr,
    .xmit = _usbdev_ep_xmit,
};
